using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace client
{
    public enum Party
    {
        Avoda=1,
        YahadutHatora,
        Yamina,
        HareshimaHameshutefet,
        KacholLavan,
        IsraelBeitenu,
        HaLikud,
        Meretz,
        Shas,
        TikvaHadasha,
        HatzionutHadatit,
        PetekLavan
        
    }
    public class Party_ins
    {
        public string name { get; set; }
        public string link { get; set; }
        public string info { get; set; }

        public Party_ins(int choice)
        {
            
            switch (choice)
            {
                case (int)Party.Avoda:
                    this.name ="העבודה";
                     this.link = "shorturl.at/kmnoM";
                     this.info =" העבודה בראשות מירב מיכאלי משויכת לשמאל הפוליטי בישראל. \nהמפלגה הוקמה ב-1968 ואיחדה את מפלגת השלטון מפאי ומפלגות קטנות יותר. גולדה מאיר, יצחק רבין ואהוד ברק היו מראשי העבודה";
                    break;
                case (int)Party.YahadutHatora:
                    this.name = "יהדות התורה";
                    this.link = "shorturl.at/hCDO8";
                    this.info = "יהדות התורה היא רשימה וסיעה חרדית אשכנזית שמהווה איחוד בין מפלגות אגודת ישראל החסידית לבין דגל התורה הליטאית. עמדותיה של המפלגה קרובות יותר לאלו של הימין. עם זאת, בנושאים כלכליים המפלגה תומכת בגישה סוציאלית, בשל החולשה הסוציו-אקונומית של מצביעיה.  מנהיגיה הרוחניים של המפלגה הם חברי מועצת גדולי התורה. בפילוג של שנת תשמט הקימה דגל התורה מועצת גדולי התורה משלה. במועצה החסידית בולטים אדמורי גור, ויזניץ ובעלז, שלכל אחד מהם בדרך כלל גם נציג בכנסת. לצדם מכהנים גם אדמורים הקשורים לסיעת שלומי אמונים.";
                    break;
                case (int)Party.Yamina:
                    this.name = "ימינה";
                    this.link = "shorturl.at/dvzI4";
                    this.info = "ימינה היא רשימה ימנית ישראלית וסיעה בכנסת בראשות ראש הממשלה נפתלי בנט. הרשימה מחזיקה כיום בשלטון בישראל ברוטציה עם מפלגת יש עתיד, מאז 13 ביוני 2021. במקור הרשימה הוקמה מאיחודן של שלוש מפלגות: הימין החדש, הבית היהודי והאיחוד הלאומי – תקומה, התמודדה לראשונה בבחירות לכנסת ה-22 בראשות איילת שקד, וקיבלה 7 מנדטים. לאחר הבחירות התפצלה לשתי סיעות: הבית היהודי – האיחוד הלאומי, והימין החדש.";
                    break;
                case (int)Party.HareshimaHameshutefet:
                    this.name = "הרשימה המשותפת";
                    this.link = "shorturl.at/qvzI8";
                    this.info = "הרשימה המשותפת (בערבית: القائمة المشتركة; בתעתיק מדויק: אל-קָאאִמַה אל-מֻשְתַרַכַּה) היא סיעה ורשימה משותפת לכנסת של המפלגות הערביות בלד, תעל וחדש (בעבר גם רעם). היא התמודדה בבחירות לכנסת ה-20 וחזרה להתמודד בבחירות לכנסת ה-22, בבחירות לכנסת ה-23, ובבחירות לכנסת ה-24, כשבכולן עמד בראשה איימן עודה.";
                    break;
                case (int)Party.KacholLavan:
                    this.name = "כחול לבן";
                    this.link = "shorturl.at/dBMOS";
                    this.info = "כחול לבן היא רשימה ציונית ליברלית ישראלית, וסיעה בכנסת. הרשימה הוקמה בינואר 2019 לקראת הבחירות לכנסת העשרים ואחת מאיחוד מפלגות חוסן לישראל ותלם יחד עם יש עתיד. במרץ 2020 התפצלו יש עתיד ותלם מהסיעה ובכנסת ה-23 היא כללה רק את חברי חוסן לישראל, אליהם הצטרפה חברת הכנסת פנינה תמנו-שטה ממפלגת יש עתיד. לאחר חקיקת החוק הנורווגי הצטרפו לסיעה גם חברות הכנסת מיכל קוטלר-וונש שהשתייכה למפלגת תלם (שעזבה אותה אחרי פיזור הכנסת) ותהלה פרידמן שהשתייכה למפלגת יש עתיד";
                    break;
                case (int)Party.PetekLavan:
                    this.name = "פתק לבן";
                    this.link = "shorturl.at/krBKL";
                    this.info = "בישראל, הצבעת מחאה בצורה של פתק ריק המכונה גם פתק לבן נחשבת כקול פסול ביחד עם מעטפות שנמצאו בהן פתקי הצבעה שונים או יותר משלושה פתקי הצבעה זהים, ועל כן אינה נספרת במניין הקולות הכשרים. מטרת הפתק היא רק להוות כפתק חלופי כאשר המצביע אינו מוצא את הפתק הנבחר, רושם עליו בכתב ידו את האותיות של הרשימה החסרה, מכניס אותו למעטפה ומשלשלו לקלפי.";
                    break;
                case (int)Party.TikvaHadasha:
                    this.name = "תקווה חדשה";
                    this.link = "shorturl.at/wW167";
                    this.info = "תקווה חדשה היא מפלגת ימין, שהתמודדה בבחירות לכנסת העשרים וארבע. יושב ראש המפלגה הוא שר המשפטים גדעון סער. המפלגה רואה במדינת ישראל כמדינת הלאום של העם היהודי ובהתאם לך רואה חשיבות להיבטים צבאיים, כלכליים, טכנולוגיים, מחקריים, התיישבותיים של המדינה ותמיכה בעלייה לישראל. המפלגה רואה בעייתיות בשסעים חברתיים בישראל ומבטיחה לפעול לאיחוים וחיבור בין חלקי העם.";
                    break;
                case (int)Party.IsraelBeitenu:
                    this.name = "ישראל ביתנו";
                    this.link = "shorturl.at/mAVX8";
                    this.info = "ישראל ביתנו היא מפלגת ימין חילונית לאומית ישראלית, אשר נוסדה ב-1999, ומונהגת מאז הקמתה על ידי אביגדור ליברמן, המכהן כיום כשר האוצר. ישראל ביתנו הוקמה בשנת 1999 על ידי אביגדור ליברמן, לאחר שפרש מהליכוד. בהתחלה הוקמה כמפלגת לוויין של הליכוד בעקבות דעיכה בנאמנות של מפלגת העולים, ישראל בעלייה למפלגת הליכוד. בנוסף המפלגה תמכה במועמדותו לראשות הממשלה של מועמד הליכוד, בנימין נתניהו. עם הקמתה נערכה גם ועידת הייסוד שלה.";
                    break;
                case (int)Party.Meretz:
                    this.name = "מרץ";
                    this.link = "shorturl.at/agEMS";
                    this.info = "מרצ היא מפלגת שמאל ציונית סוציאל-דמוקרטית ישראלית. המפלגה הורכבה בשנת 1992 מאיחוד של המפלגות רצ, מפם וחלק משינוי. השם מרצ מורכב מהאותיות מ ורצ, אותיות שהופיעו על פתקי ההצבעה של המייסדות, מפם ורצ. המפלגה הייתה בשיאה בכנסת ה-13, כשזכתה ל-12 מנדטים והייתה שותפה בכירה בממשלת רבין השנייה. המפלגה שותפה בממשלת ישראל ה-36. יושב ראש המפלגה הנוכחי, ניצן הורוביץ, מכהן כשר הבריאות, וכן מכהנים מטעמה תמר זנדברג כשרה להגנת הסביבה, עיסאווי פריג' כשר לשיתוף פעולה אזורי ויאיר גולן כסגן שרת הכלכלה והתעשייה.";
                    break;
                case (int)Party.HatzionutHadatit:
                    this.name = "הציונות הדתית";
                    this.link = "shorturl.at/elyU5";
                    this.info = "הציונות הדתית היא רשימה וסיעה, המזוהה עם הזרם הדתי לאומי שהתמודדה בבחירות לכנסת העשרים וארבע ונבחרה לכנסת. הרשימה היא בלוק טכני שכולל שלוש מפלגות. בראשה עומד יור האיחוד הלאומי בצלאל סמוטריץ. יור עוצמה יהודית איתמר בן-גביר מוצב במקום השלישי ויור נעם אבי מעוז במקום השישי. היא חתמה על הסכם עודפים עם הליכוד. הרשימה קיבלה בבחירות 6 מנדטים ונכנסה לכנסת ה-24. ";
                    break;
                case (int)Party.Shas:
                    this.name = "שס";
                    this.link = "shorturl.at/gyS28";
                    this.info = "שס נוסדה כמפלגה ברמה הארצית בשנת 1984, לקראת הבחירות לכנסת האחת עשרה, על רקע תחושתם של החרדים הספרדים כי הם מקופחים בהשוואה לאשכנזים. עם הקמתה ברמה הארצית, הוקמה גם מועצת חכמי התורה בראשות הרב עובדיה יוסף, והפוסקים העליונים היו הרב מנחם שך (שעמד בראש רשת הישיבות הליטאיות) והרב יוסף. לאחר 1990 פרש הרב שך מתפקידו זה, והרב עובדיה יוסף נותר מנהיגה הרוחני היחיד של המפלגה.";
                    break;
                case (int)Party.HaLikud:
                    this.name = "הליכוד";
                    this.link = "אין מצע";
                    this.info = "הליכוד היא מפלגה ציונית ליברלית וקפיטליסטית בימין המפה הפוליטית בישראל. היא קמה בשנת 1973 כברית מפלגות, שהתאחדו למפלגה יחידה בשנת 1988. מאז שהוקמה ועד היום למעט הכנסת השבע עשרה היא אחת משתי המפלגות הגדולות בישראל. בין מנהיגי המפלגה הבולטים- יצחק שמיר, מנחם בגין, אריאל שרון ובנימין נתניהו.";
                    break;
            }
            
        }
    }
}
